Re1e4/kOmegaSST/6g/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    back
    {
        type            empty;
       inGroups 1(empty);
        nFaces          118995;
        startFace       176786;
    }
    front
    {
          type            empty;
       inGroups 1(empty);
        nFaces          118995;
        startFace       295781;
    }
    airfoil
    {
          type            wall;
       inGroups 1(wall);
        nFaces          3168;
        startFace       414776;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          63;
        startFace       417944;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       418007;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       418086;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          79;
        startFace       418110;
    }
)

// ************************************************************************* //
