Re1e4/kOmegaSST/6g/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;//1.994e-5;//7.15542e-7;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10;//7.15542e-7;
    }
    outlet
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
    top
    {
        type            fixedValue;
        value           uniform 10;//7.15542e-7;
    }
    bottom
    {
        type           fixedValue;
        value           uniform 10;//7.15542e-7;
    }
    front
    {
        type            empty;
    }
   back
   {
        type            empty;
    }
}


// ************************************************************************* //
